TienHuyIoT/ESP32Async-AsyncTCP/src/AsyncTCP.cpp
public:
  inline queue_mutex_guard() : holds_mutex(xSemaphoreTake(_async_queue_mutex, portMAX_DELAY)){};
  inline ~queue_mutex_guard() {
    if (holds_mutex) {
      xSemaphoreGive(_async_queue_mutex);
    }
  };
  inline explicit operator bool() const {
    return holds_mutex;
  };
};
}  // anonymous namespace

static SimpleIntrusiveList<lwip_tcp_event_packet_t> _async_queue;
static TaskHandle_t _async_service_task_handle = NULL;

// Helper: Register and Unregister Clients
static AsyncClient *_clients[CONFIG_LWIP_MAX_ACTIVE_TCP];
static SemaphoreHandle_t _client_slot_mutex;

static s8_t _client_slot_available() {
  s8_t slot = INVALID_CLIENT_SLOT;
  xSemaphoreTake(_client_slot_mutex, portMAX_DELAY);
  for (u8_t i = 0; i < CONFIG_LWIP_MAX_ACTIVE_TCP; ++i) {
    if (!_clients[i]) {
      slot = i;
      break;
    }
  }
  xSemaphoreGive(_client_slot_mutex);
  return slot;
}

static s8_t _register_client_slot(AsyncClient *client) {
  if (!client) {
    return INVALID_CLIENT_SLOT;
  }
  s8_t slot = INVALID_CLIENT_SLOT;
  xSemaphoreTake(_client_slot_mutex, portMAX_DELAY);
  for (u8_t i = 0; i < CONFIG_LWIP_MAX_ACTIVE_TCP; ++i) {
    if (!_clients[i]) {
      _clients[i] = client;
      slot = i;
      ASYNC_TCP_CONSOLE("Slot[%d] = %u", i, client);
      break;
    }
  }
  xSemaphoreGive(_client_slot_mutex);
  return slot;
}

static s8_t _unregister_client_slot(AsyncClient *client) {
  if (!client) {
    return INVALID_CLIENT_SLOT;
  }
  s8_t slot = INVALID_CLIENT_SLOT;
  xSemaphoreTake(_client_slot_mutex, portMAX_DELAY);
  for (u8_t i = 0; i < CONFIG_LWIP_MAX_ACTIVE_TCP; ++i) {
    if (_clients[i] == client) {
      _clients[i] = NULL;
      slot = i;
      ASYNC_TCP_CONSOLE("Slot[%d] = %u", i, client);
      break;
    }
  }
  xSemaphoreGive(_client_slot_mutex);
  return slot;
}

static bool _is_client_slot_valid(AsyncClient *client) {
  if (!client) {
    return false;
  }
  bool found = false;
  xSemaphoreTake(_client_slot_mutex, portMAX_DELAY);
  for (u8_t i = 0; i < CONFIG_LWIP_MAX_ACTIVE_TCP; ++i) {
    if (_clients[i] == client) {
      found = true;
      break;
    }
  }
  xSemaphoreGive(_client_slot_mutex);
  return found;
}

static bool _is_pcb_slot_valid(s8_t slot, tcp_pcb *pcb) {
  AsyncClient *c = _clients[slot];
  return (c && c->_pcb == pcb);
}

static void _free_event(lwip_tcp_event_packet_t *evpkt) {
  if ((evpkt->event == LWIP_TCP_RECV) && (evpkt->recv.pb != nullptr)) {
    ASYNC_TCP_CONSOLE("Free ev: client %u slot = %d pb = %u", evpkt->client, evpkt->client->closedSlot(), evpkt->recv.pb);
    pbuf_free(evpkt->recv.pb);
  }
  delete evpkt;
}

static inline void _send_async_event(lwip_tcp_event_packet_t *e) {
  assert(e != nullptr);
  _async_queue.push_back(e);
  xTaskNotifyGive(_async_service_task_handle);
}

static inline void _prepend_async_event(lwip_tcp_event_packet_t *e) {
  assert(e != nullptr);
  _async_queue.push_front(e);
  xTaskNotifyGive(_async_service_task_handle);
}

static inline lwip_tcp_event_packet_t *_get_async_event() {
  queue_mutex_guard guard;
  while (1) {
    lwip_tcp_event_packet_t *e = _async_queue.pop_front();

    if ((!e) || (e->event != LWIP_TCP_POLL)) {
      return e;
    }

    /*
      Let's try to coalesce two (or more) consecutive poll events into one
      this usually happens with poor implemented user-callbacks that are runs too long and makes poll events to stack in the queue
      if consecutive user callback for a same connection runs longer that poll time then it will fill the queue with events until it deadlocks.
      This is a workaround to mitigate such poor designs and won't let other events/connections to starve the task time.
      It won't be effective if user would run multiple simultaneous long running callbacks due to message interleaving.
      todo: implement some kind of fair dequeuing or (better) simply punish user for a bad designed callbacks by resetting hog connections
    */
    for (lwip_tcp_event_packet_t *next_pkt = _async_queue.begin(); next_pkt && (next_pkt->client == e->client) && (next_pkt->event == LWIP_TCP_POLL);
         next_pkt = _async_queue.begin()) {
      // if the next event that will come is a poll event for the same connection, we can discard it and continue
      _free_event(_async_queue.pop_front());
      log_d("coalescing polls, network congestion or async callbacks might be too slow!");
    }

    /*
      now we have to decide if to proceed with poll callback handler or discard it?
      poor designed apps using asynctcp without proper dataflow control could flood the queue with interleaved pool/ack events.
      I.e. on each poll app would try to generate more data to send, which in turn results in additional ack event triggering chain effect
      for long connections. Or poll callback could take long time starving other connections. Anyway our goal is to keep the queue length
      grows under control (if possible) and poll events are the safest to discard.
      Let's discard poll events processing using linear-increasing probability curve when queue size grows over 3/4
      Poll events are periodic and connection could get another chance next time
    */
    if (_async_queue.size() > (rand() % CONFIG_ASYNC_TCP_QUEUE_SIZE / 4 + CONFIG_ASYNC_TCP_QUEUE_SIZE * 3 / 4)) {
      _free_event(e);
      log_d("discarding poll due to queue congestion");
      continue;
    }

    return e;
  }
}

static void _remove_events_for_client(AsyncClient *client) {
  lwip_tcp_event_packet_t *removed_event_chain;
  {
    queue_mutex_guard guard;
    removed_event_chain = _async_queue.remove_if([client](lwip_tcp_event_packet_t &pkt) {
      return pkt.client == client;
    });
  }

  while (removed_event_chain) {
    auto t = removed_event_chain;
    removed_event_chain = t->next;
    _free_event(t);
  }
};

void AsyncTCP_detail::handle_async_event(lwip_tcp_event_packet_t *e) {
  if (e->client == NULL) {
    if (e->event == LWIP_TCP_CALLBACK) {
      e->callback.fn(e->callback.arg);
    }
    return;
  }

  if (e->event == LWIP_TCP_RECV) {
    // ets_printf("-R: 0x%08x\n", e->recv.pcb);
    e->client->_recv(e->recv.pcb, e->recv.pb, e->recv.err);
    e->recv.pb = nullptr;  // avoid _free_event() shall call pbuf_free() again due to _recv() called pbuf_free() inside.
  } else if (e->event == LWIP_TCP_FIN) {
    // ets_printf("-F: 0x%08x\n", e->fin.pcb);
    e->client->_fin(e->fin.pcb, e->fin.err);
  } else if (e->event == LWIP_TCP_DISCONNECT) {
    // ets_printf("-F: 0x%08x\n", e->fin.pcb);
    e->client->_disconnect(e->fin.err);
  } else if (e->event == LWIP_TCP_SENT) {
    // ets_printf("-S: 0x%08x\n", e->sent.pcb);
    e->client->_sent(e->sent.pcb, e->sent.len);
  } else if (e->event == LWIP_TCP_POLL) {
    // ets_printf("-P: 0x%08x\n", e->poll.pcb);
    e->client->_poll(e->poll.pcb);
  } else if (e->event == LWIP_TCP_ERROR) {
    // ets_printf("-E: 0x%08x %d\n", e->client, e->error.err);
    e->client->_error(e->error.err);
  } else if (e->event == LWIP_TCP_CONNECTED) {
    // ets_printf("C: 0x%08x 0x%08x %d\n", e->client, e->connected.pcb, e->connected.err);
    e->client->_connected(e->connected.pcb);
  } else if (e->event == LWIP_TCP_ACCEPT) {
    // ets_printf("A: 0x%08x 0x%08x\n", e->client, e->accept.client);
    e->accept.server->_accepted(e->client);
  } else if (e->event == LWIP_TCP_DNS) {
    // ets_printf("D: 0x%08x %s = %s\n", e->client, e->dns.name, ipaddr_ntoa(&e->dns.addr));
    e->client->_dns_found(&e->dns.addr);
  }
}

static void _async_service_task(void *pvParameters) {
#if CONFIG_ASYNC_TCP_USE_WDT
  if (esp_task_wdt_add(NULL) != ESP_OK) {
    log_w("Failed to add async task to WDT");
  }
#endif
  for (;;) {
    while (auto packet = _get_async_event()) {
      AsyncTCP_detail::handle_async_event(packet);
      _free_event(packet);
#if CONFIG_ASYNC_TCP_USE_WDT
      esp_task_wdt_reset();
#endif
    }
    // queue is empty
    // DEBUG_PRINTF("Async task waiting 0x%08",(intptr_t)_async_queue_head);
    ulTaskNotifyTake(pdTRUE, ASYNC_TCP_MAX_TASK_SLEEP);
    // DEBUG_PRINTF("Async task woke = %d 0x%08x",q, (intptr_t)_async_queue_head);
#if CONFIG_ASYNC_TCP_USE_WDT
    esp_task_wdt_reset();
#endif
  }
#if CONFIG_ASYNC_TCP_USE_WDT
  esp_task_wdt_delete(NULL);
#endif
  vTaskDelete(NULL);
  _async_service_task_handle = NULL;
}

