TienHuyIoT/ESP32Async-AsyncTCP/src/AsyncTCP.cpp
/*
static void _stop_async_task(){
    if(_async_service_task_handle){
        vTaskDelete(_async_service_task_handle);
        _async_service_task_handle = NULL;
    }
}
*/

static bool customTaskCreateUniversal(
  TaskFunction_t pxTaskCode, const char *const pcName, const uint32_t usStackDepth, void *const pvParameters, UBaseType_t uxPriority,
  TaskHandle_t *const pxCreatedTask, const BaseType_t xCoreID
) {
#ifndef CONFIG_FREERTOS_UNICORE
  if (xCoreID >= 0 && xCoreID < 2) {
    return xTaskCreatePinnedToCore(pxTaskCode, pcName, usStackDepth, pvParameters, uxPriority, pxCreatedTask, xCoreID);
  } else {
#endif
    return xTaskCreate(pxTaskCode, pcName, usStackDepth, pvParameters, uxPriority, pxCreatedTask);
#ifndef CONFIG_FREERTOS_UNICORE
  }
#endif
}

static bool _start_async_task() {
  if (!_async_queue_mutex) {
    _async_queue_mutex = xSemaphoreCreateMutex();
    if (!_async_queue_mutex) {
      return false;
    }
  }

  if (!_client_slot_mutex) {
    _client_slot_mutex = xSemaphoreCreateMutex();
    if (!_client_slot_mutex) {
      return false;
    }
  }

  if (!_async_service_task_handle) {
    customTaskCreateUniversal(
      _async_service_task, "async_tcp", CONFIG_ASYNC_TCP_STACK_SIZE, NULL, CONFIG_ASYNC_TCP_PRIORITY, &_async_service_task_handle, CONFIG_ASYNC_TCP_RUNNING_CORE
    );
    if (!_async_service_task_handle) {
      return false;
    }
  }
  return true;
}

/*
 * LwIP Callbacks
 * */

 // For safe: only run in LwIP callbacks or TPC/IP raw API tcpip_api_call and tcpip_callback
static void _bind_tcp_callbacks(tcp_pcb *pcb, AsyncClient *client) {
  tcp_arg(pcb, client);
  tcp_recv(pcb, &AsyncTCP_detail::tcp_recv);
  tcp_sent(pcb, &AsyncTCP_detail::tcp_sent);
  tcp_err(pcb, &AsyncTCP_detail::tcp_error);
  tcp_poll(pcb, &AsyncTCP_detail::tcp_poll, CONFIG_ASYNC_TCP_POLL_TIMER);
}

// For safe: only run in LwIP callbacks or TPC/IP raw API tcpip_api_call and tcpip_callback
static void _reset_tcp_callbacks(tcp_pcb *pcb, AsyncClient *client) {
  tcp_arg(pcb, NULL);
  tcp_sent(pcb, NULL);
  tcp_recv(pcb, NULL);
  tcp_err(pcb, NULL);
  tcp_poll(pcb, NULL, 0);
}

// TCP Server: listen pcb callback
err_t AsyncTCP_detail::tcp_accept(void *arg, tcp_pcb *pcb, err_t err) {
  AsyncServer *s = reinterpret_cast<AsyncServer *>(arg);
  AsyncClient *c = (ERR_OK == err && pcb && s) ? new (std::nothrow) AsyncClient(pcb, s) : nullptr;
  lwip_tcp_event_packet_t *e = (c) ? new (std::nothrow) lwip_tcp_event_packet_t{LWIP_TCP_ACCEPT, c} : nullptr;
  s8_t slot = (e) ? _register_client_slot(c) : INVALID_CLIENT_SLOT;
  bool accepted = (slot != INVALID_CLIENT_SLOT && s->_listen_connect_cb) ? true : false;

  if (!accepted) {
    ASYNC_TCP_CONSOLE("Accept failed: %d", err);

    if (e) {
      delete e;
    }
    
    if (c) {
      delete c;
    }

    if (slot != INVALID_CLIENT_SLOT) {
      _unregister_client_slot(c);
    }

    if (pcb) {
      tcp_abort(pcb);
      // https://github.com/espressif/esp-lwip/blob/master/src/core/tcp.c#L636
      return ERR_ABRT;  // correct after aborting
    }
    return ERR_MEM;  // Didn't abort anything, just report resource issue
  }
  
  queue_mutex_guard guard;
  c->_pcb = pcb;
  c->_slot = slot;  // now slot is valid
  e->client = c;
  e->accept.server = s;
  _bind_tcp_callbacks(pcb, c);
  _prepend_async_event(e);
  return ERR_OK;
}

/**
 * TCP Client: connection callback
 * Do not need to call tcp_abort(pcb).
 * Just only need to return error status and leave the _tcp_connect_api handle.
*/
err_t AsyncTCP_detail::tcp_connected(void *arg, tcp_pcb *pcb, err_t err) {
  AsyncClient *c = reinterpret_cast<AsyncClient *>(arg);
  lwip_tcp_event_packet_t *e = (ERR_OK == err && pcb && c) ? new (std::nothrow) lwip_tcp_event_packet_t{LWIP_TCP_CONNECTED, c} : nullptr;
  s8_t slot = (e) ? _register_client_slot(c) : INVALID_CLIENT_SLOT;
  if (INVALID_CLIENT_SLOT == slot) {
    ASYNC_TCP_CONSOLE("Connection failed");
    if (e) {
      delete e;
    }
    return ERR_MEM;
  }
  queue_mutex_guard guard;
  c->_pcb = pcb;
  c->_slot = slot; // now slot is valid 
  e->connected.pcb = pcb;
  _bind_tcp_callbacks(pcb, c);
  _prepend_async_event(e);
  return ERR_OK;
}

err_t AsyncTCP_detail::tcp_poll(void *arg, struct tcp_pcb *pcb) {
  // throttle polling events queueing when event queue is getting filled up, let it handle _onack's
  {
    queue_mutex_guard guard;
    if (_async_queue.size() > (rand() % CONFIG_ASYNC_TCP_QUEUE_SIZE / 4 + CONFIG_ASYNC_TCP_QUEUE_SIZE * 3 / 4)) {
      ASYNC_TCP_CONSOLE("throttling");
      return ERR_OK;
    }
  }

  AsyncClient *c = reinterpret_cast<AsyncClient *>(arg);
  bool slot = _is_client_slot_valid(c);
  lwip_tcp_event_packet_t *e = (slot) ? new (std::nothrow) lwip_tcp_event_packet_t{LWIP_TCP_POLL, c} : nullptr;
  if (!e) {
    ASYNC_TCP_CONSOLE("Failed to allocate event packet");
    if (slot) {
      c->_lwip_abort(pcb);
      c->_error(ERR_MEM);
    } else {
      tcp_abort(pcb);
    }
    return ERR_ABRT;  // Tell lwIP we're killing it immediately
  }
  e->poll.pcb = pcb;

  queue_mutex_guard guard;
  _send_async_event(e);
  return ERR_OK;
}

/**
 * _lwip_close --> _fin --> _disconnect() --> ~AsyncClient()
 * _lwip_abort --> _error --> _disconnect() --> ~AsyncClient()
*/
err_t AsyncTCP_detail::tcp_recv(void *arg, struct tcp_pcb *pcb, struct pbuf *pb, err_t err) {
  AsyncClient *c = reinterpret_cast<AsyncClient *>(arg);
  bool slot = _is_client_slot_valid(c);
  lwip_tcp_event_packet_t *e = (slot) ? new (std::nothrow) lwip_tcp_event_packet_t{LWIP_TCP_RECV, c} : nullptr;
  if (!e) {
    ASYNC_TCP_CONSOLE("Failed to allocate event packet");
    if (pb) {
      if (err == ERR_OK) tcp_recved(pcb, pb->tot_len);
      pbuf_free(pb);
    }
    if (slot) {
      c->_lwip_abort(pcb);
      c->_error(ERR_MEM);
    } else {
      tcp_abort(pcb);
    }
    return ERR_ABRT;  // Tell lwIP we're killing it immediately
  }

  e->recv.pcb = pcb;
  e->recv.err = err;
  e->recv.pb = pb;

  if (pb) {
    if (err != ERR_OK) {
      ASYNC_TCP_CONSOLE("err %s", c->errorToString(err));
      delete e;
      pbuf_free(pb);
      c->_lwip_abort(pcb);
      c->_error(err);
      return ERR_ABRT;  // Tell lwIP we're killing it immediately
    }

