TienHuyIoT/ESP32Async-AsyncTCP/src/AsyncTCP.cpp
bool AsyncClient::connect(const char *host, uint16_t port) {
  ip_addr_t addr;

  ASYNC_TCP_CONSOLE("%u host %s, port: %u", this, host, port);

  if (!_start_async_task()) {
    ASYNC_TCP_CONSOLE("failed to start task");
    return false;
  }

  _connect_port = port;
  err_t err = _dns_gethostbyname(host, &addr, AsyncTCP_detail::_tcp_dns_found, this);

  if (err == ERR_OK) {
    ASYNC_TCP_CONSOLE("IP: %s\n", ipaddr_ntoa(&addr));
#if ESP_IDF_VERSION_MAJOR < 5
#if LWIP_IPV6
    if (addr.type == IPADDR_TYPE_V6) {
      return connect(IPv6Address(addr.u_addr.ip6.addr), port);
    }
    return connect(IPAddress(addr.u_addr.ip4.addr), port);
#else
    return connect(IPAddress(addr.addr), port);
#endif
#else
    return connect(addr, port);
#endif
  } else if (err == ERR_INPROGRESS) {
    ASYNC_TCP_CONSOLE("DNS query sent, waiting for callback...\n");
    return true;
  }
  ASYNC_TCP_CONSOLE("error: %d", err);
  return false;
}

/**
 * close() --> onDisconnect() --> ~AsyncClient()
*/
void AsyncClient::close(bool now) {
  lwip_tcp_event_packet_t *e = new (std::nothrow) lwip_tcp_event_packet_t{LWIP_TCP_DISCONNECT, this};
  if (!e) {
    ASYNC_TCP_CONSOLE("Failed to allocate event packet");
    _close(); // client shall be closed directly in lwIP thread
    _remove_events_for_client(this);
    // Forcing disconnection here may not be safe, but there's no other way.
    _disconnect(ERR_CLSD);
    return;
  }

  if (now) {
    _close(); // client shall be closed directly in lwIP thread 
    _remove_events_for_client(this);
  } // else client shall be called to close in Async thread

  e->disconnect.err = now ? ERR_CLSD : ERR_ISCONN;
  queue_mutex_guard guard;
  if (now) {
    _prepend_async_event(e);
  } else {
    _send_async_event(e);
  }
}

/**
 * abort() -->onDisconnect() --> ~AsyncClient()
*/
err_t AsyncClient::abort() {
  _remove_events_for_client(this);
  lwip_tcp_event_packet_t *e = new (std::nothrow) lwip_tcp_event_packet_t{LWIP_TCP_DISCONNECT, this};
  if (!e) {
    ASYNC_TCP_CONSOLE("Failed to allocate event packet");
    _abort(); // client shall be abort directly in lwIP thread
    // Forcing disconnection here may not be safe, but there's no other way.
    _disconnect(ERR_CLSD);
    return ERR_ABRT;
  }
  _abort(); // client shall be abort directly in lwIP thread
  e->disconnect.err = ERR_CLSD;
  queue_mutex_guard guard;
  _prepend_async_event(e);
  return ERR_ABRT;
}

size_t AsyncClient::space() const {
  if ((_pcb != NULL) && (_pcb->state == ESTABLISHED)) {
    return tcp_sndbuf(_pcb);
  }
  return 0;
}

size_t AsyncClient::add(const char *data, size_t size, uint8_t apiflags) {
  if (!_pcb || size == 0 || data == NULL) {
    return 0;
  }
  size_t room = space();
  if (!room) {
    return 0;
  }
  size_t will_send = (room < size) ? room : size;
  err_t err = ERR_OK;
  err = _tcp_write(_pcb, _slot, data, will_send, apiflags);
  if (err != ERR_OK) {
    return 0;
  }
  return will_send;
}

bool AsyncClient::send() {
  auto backup = _tx_last_packet;
  _tx_last_packet = millis();
  if (_tcp_output(_pcb, _slot) == ERR_OK) {
    return true;
  }
  _tx_last_packet = backup;
  return false;
}

size_t AsyncClient::ack(size_t len) {
  if (len > _rx_ack_len) {
    len = _rx_ack_len;
  }
  _rx_ack_len -= len;
  return len;
}

void AsyncClient::ackPacket(struct pbuf *pb) {
  if (!pb) {
    return;
  }
  pbuf_free(pb);
}

/*
 * Main Private Methods
 * */

err_t AsyncClient::_close() {
  ASYNC_TCP_CONSOLE("client %u", this);
  err_t err = ERR_OK;
#if (1)
  err = _tcp_close(_pcb, _slot, [](void *arg) {
    // run in LwIP thread
    AsyncClient *c = (AsyncClient *)arg;
    c->_pcb = nullptr;
    c->_slot = INVALID_CLIENT_SLOT;
    _unregister_client_slot(c);
  }, this);
#else
  tcpip_callback([](void *arg) {
    // run in LwIP thread
    AsyncClient *c = (AsyncClient *)arg;
    if (c->_pcb) {
      _reset_tcp_callbacks(c->_pcb, c); // It has to be called before tcp_close();
      if (tcp_close(c->_pcb) != ERR_OK) {
        tcp_abort(c->_pcb);
      }
    }
    c->_pcb = nullptr;
    c->_slot = INVALID_CLIENT_SLOT;
    _unregister_client_slot(c);
  }, this);
  delay(1); // Allow switching to LwIP thread
#endif
  return err;
}

err_t AsyncClient::_abort() {
  ASYNC_TCP_CONSOLE("client %u", this);
#if (1)
  _tcp_abort(_pcb, _slot, [](void *arg) {
    // run in LwIP thread
    AsyncClient *c = (AsyncClient *)arg;
    c->_pcb = nullptr;
    c->_slot = INVALID_CLIENT_SLOT;
    _unregister_client_slot(c);
  }, this);
#else
  tcpip_callback([](void *arg) {
    // run in LwIP thread
    AsyncClient *c = (AsyncClient *)arg;
    if (c->_pcb) {
      _reset_tcp_callbacks(c->_pcb, c); // It has to be called before tcp_abort();
      tcp_abort(c->_pcb);
    }
    c->_pcb = nullptr;
    c->_slot = INVALID_CLIENT_SLOT;
    _unregister_client_slot(c);
  }, this);
  delay(1); // Allow switching to LwIP thread
#endif
  return ERR_ABRT;
}

void AsyncClient::resetCallback() {
  _connect_cb = nullptr;
  _discard_cb = nullptr;
  _sent_cb = nullptr;
  _error_cb = nullptr;
  _recv_cb = nullptr;
  _pb_cb = nullptr;
  _timeout_cb = nullptr;
  _poll_cb = nullptr;
}

bool AsyncClient::valid() {
  return !!_pcb;
}

/*
 * Private Callbacks
 * */
err_t AsyncClient::_connected(tcp_pcb *pcb) {
  ASYNC_TCP_CONSOLE("client %u", this);
  if (_pcb) {
    _rx_last_packet = millis();
  }
  _tx_last_packet = 0;
  _rx_last_ack = 0;
  if (_connect_cb) {
    _connect_cb(_connect_cb_arg, this);
  }
  return ERR_OK;
}

void AsyncClient::_disconnect(err_t err) {
  ASYNC_TCP_CONSOLE("client %u", this);
  if (ERR_ISCONN == err) {
    _close(); // close client in lwIP thread 
  }

  if (_discard_cb) {
    _discard_cb(_discard_cb_arg, (_server) ? nullptr : this);
  }

  // Has to be called after callback _discard_cb()
  if (_server) {
    _server->_handleDisconnect(this);
  }
}

void AsyncClient::_error(err_t err) {
  ASYNC_TCP_CONSOLE("client %u", this);
  if (_error_cb) {
    _error_cb(_error_cb_arg, this, err);
  }
  _disconnect(ERR_CLSD);
}

// Must be called In LwIP Thread
err_t AsyncClient::_lwip_abort(tcp_pcb *pcb) {
  _remove_events_for_client(this);
  _reset_tcp_callbacks(pcb, this);
  tcp_abort(pcb);
  _pcb = nullptr;
  _slot = INVALID_CLIENT_SLOT;
  _unregister_client_slot(this);
  return ERR_ABRT;
}

// Must be called In LwIP Thread
err_t AsyncClient::_lwip_close(tcp_pcb *pcb) {
  err_t err = ERR_OK;
  _reset_tcp_callbacks(pcb, this);
  if (tcp_close(pcb) != ERR_OK) {
    tcp_abort(pcb);
    err = ERR_ABRT;
  }
  _pcb = nullptr;
  _slot = INVALID_CLIENT_SLOT;
  _unregister_client_slot(this);
  return err;
}

// In Async Thread
err_t AsyncClient::_fin(tcp_pcb *pcb, err_t err) {
  ASYNC_TCP_CONSOLE("client %u", this);
  _disconnect(ERR_CLSD);
  return ERR_OK;
}

err_t AsyncClient::_sent(tcp_pcb *pcb, uint16_t len) {
  _rx_last_ack = _rx_last_packet = millis();
  if (_sent_cb) {
    _sent_cb(_sent_cb_arg, this, len, (_rx_last_packet - _tx_last_packet));
  }
  return ERR_OK;
}

err_t AsyncClient::_recv(tcp_pcb *pcb, pbuf *pb, err_t err) {
  while (pb != NULL) {
    _rx_last_packet = millis();
    // we should not ack before we assimilate the data
    // _ack_pcb = true; // It is always true with whenever new client established. It should not force true here due to the ackLater() will not be valid anymore
    pbuf *b = pb;
    pb = b->next;
    b->next = NULL;
    if (_pb_cb) {
      _pb_cb(_pb_cb_arg, this, b);
    } else {
      if (_recv_cb) {
        _recv_cb(_recv_cb_arg, this, b->payload, b->len);
      }
      if (!_ack_pcb) {
        _rx_ack_len += b->len;
      }
      pbuf_free(b);
    }
  }
  return ERR_OK;
}

err_t AsyncClient::_poll(tcp_pcb *pcb) {
  if (!_pcb) {
    ASYNC_TCP_CONSOLE("pcb is NULL");
    return ERR_OK;
  }
  if (pcb != _pcb) {
    ASYNC_TCP_CONSOLE("0x%08" PRIx32 " != 0x%08" PRIx32, (uint32_t)pcb, (uint32_t)_pcb);
    return ERR_OK;
  }

