TienHuyIoT/ESP32Async-AsyncTCP/src/AsyncTCP.cpp
bool AsyncClient::disconnecting() const {
  if (!_pcb) {
    return false;
  }
  return _pcb->state > ESTABLISHED && _pcb->state < TIME_WAIT;
}

bool AsyncClient::disconnected() const {
  if (!_pcb) {
    return true;
  }
  return _pcb->state == CLOSED || _pcb->state == TIME_WAIT;
}

bool AsyncClient::freeable() const {
  if (!_pcb) {
    return true;
  }
  return _pcb->state == CLOSED || _pcb->state > ESTABLISHED;
}

bool AsyncClient::canSend() const {
  return space() > 0;
}

const char *AsyncClient::errorToString(err_t error) {
  switch (error) {
    case ERR_OK:         return "OK";
    case ERR_MEM:        return "Out of memory error";
    case ERR_BUF:        return "Buffer error";
    case ERR_TIMEOUT:    return "Timeout";
    case ERR_RTE:        return "Routing problem";
    case ERR_INPROGRESS: return "Operation in progress";
    case ERR_VAL:        return "Illegal value";
    case ERR_WOULDBLOCK: return "Operation would block";
    case ERR_USE:        return "Address in use";
    case ERR_ALREADY:    return "Already connected";
    case ERR_CONN:       return "Not connected";
    case ERR_IF:         return "Low-level netif error";
    case ERR_ABRT:       return "Connection aborted";
    case ERR_RST:        return "Connection reset";
    case ERR_CLSD:       return "Connection closed";
    case ERR_ARG:        return "Illegal argument";
    case -55:            return "DNS failed";
    default:             return "UNKNOWN";
  }
}

const char *AsyncClient::stateToString() const {
  switch (state()) {
    case 0:  return "Closed";
    case 1:  return "Listen";
    case 2:  return "SYN Sent";
    case 3:  return "SYN Received";
    case 4:  return "Established";
    case 5:  return "FIN Wait 1";
    case 6:  return "FIN Wait 2";
    case 7:  return "Close Wait";
    case 8:  return "Closing";
    case 9:  return "Last ACK";
    case 10: return "Time Wait";
    default: return "UNKNOWN";
  }
}

/*
  Async TCP Server
 */

AsyncServer::AsyncServer(ip_addr_t addr, uint16_t port)
  : _port(port), _addr(addr), _noDelay(false), _pcb(nullptr), _listen_connect_cb(nullptr), _connect_cb_arg(nullptr) {}

#ifdef ARDUINO
AsyncServer::AsyncServer(IPAddress addr, uint16_t port) : _port(port), _noDelay(false), _pcb(0), _listen_connect_cb(0), _connect_cb_arg(0) {
#if ESP_IDF_VERSION_MAJOR < 5
#if LWIP_IPV4 && LWIP_IPV6
  _addr.type = IPADDR_TYPE_V4;
  _addr.u_addr.ip4.addr = addr;
#else
  _addr.addr = addr;
#endif
#else
  addr.to_ip_addr_t(&_addr);
#endif
}
#if ESP_IDF_VERSION_MAJOR < 5 && __has_include(<IPv6Address.h>) && LWIP_IPV6
AsyncServer::AsyncServer(IPv6Address addr, uint16_t port) : _port(port), _noDelay(false), _pcb(0), _listen_connect_cb(0), _connect_cb_arg(0) {
#if LWIP_IPV4 && LWIP_IPV6
  _addr.type = IPADDR_TYPE_V6;
#endif
  auto ipaddr = static_cast<const uint32_t *>(addr);
  _addr = IPADDR6_INIT(ipaddr[0], ipaddr[1], ipaddr[2], ipaddr[3]);
}
#endif
#endif

AsyncServer::AsyncServer(uint16_t port) : _port(port), _noDelay(false), _pcb(0), _listen_connect_cb(0), _connect_cb_arg(0) {
#if LWIP_IPV4 && LWIP_IPV6
  _addr.type = IPADDR_TYPE_ANY;
  _addr.u_addr.ip4.addr = INADDR_ANY;
#else
  _addr.addr = INADDR_ANY;
#endif
}

AsyncServer::~AsyncServer() {
  end();
}

void AsyncServer::onClient(AcConnectHandler cb, void *arg) {
  _listen_connect_cb = cb;
  _connect_cb_arg = arg;
}

void AsyncServer::begin() {
  if (_pcb) {
    return;
  }

  if (!_start_async_task()) {
    ASYNC_TCP_CONSOLE("failed to start task");
    return;
  }

  // Safely to run in the LwIP thread
  tcpip_callback([](void *arg) {
    AsyncServer *server = (AsyncServer *)arg;
    err_t err;
#if LWIP_IPV4 && LWIP_IPV6
    server->_pcb = tcp_new_ip_type(server->_addr.type);
#else
    _pcb = _tcp_new_ip_type(IPADDR_TYPE_ANY);
#endif
    if (!server->_pcb) {
      ASYNC_TCP_CONSOLE("_pcb == NULL");
      return;
    }

    err = tcp_bind(server->_pcb, &server->_addr, server->_port);

    if (err != ERR_OK) {
      ASYNC_TCP_CONSOLE("bind error: %d", err);
      tcp_abort(server->_pcb); // forcibly free unbound PCB
      server->_pcb = NULL;
      return;
    }

    constexpr uint8_t backlog = CONFIG_LWIP_MAX_ACTIVE_TCP / 2; // up to you
    server->_pcb = tcp_listen_with_backlog(server->_pcb, backlog);
    if (!server->_pcb) {
      ASYNC_TCP_CONSOLE("listen_pcb == NULL");
      return;
    }
    tcp_arg(server->_pcb, (void *)server);
    tcp_accept(server->_pcb, &AsyncTCP_detail::tcp_accept);
  }, this);
}

void AsyncServer::end() {
  tcpip_callback([](void *arg) {
    // run in LwIP thread
    AsyncServer *s = (AsyncServer *)arg;
    if (s->_pcb) {
      tcp_arg(s->_pcb, NULL);
      tcp_accept(s->_pcb, NULL);
      if (tcp_close(s->_pcb) != ERR_OK) {
        tcp_abort(s->_pcb);
      }
      s->_pcb = NULL;
    }
  }, this);

  delay(1); // Allow switching to LwIP thread

  xSemaphoreTake(_client_slot_mutex, portMAX_DELAY);
  for (int i = 0; i < CONFIG_LWIP_MAX_ACTIVE_TCP; ++i) {
    AsyncClient *c = _clients[i];
    if (c && c->_pcb && c->_server == this) {
      c->close(true); // close immediately in LwIP thread
    }
  }
  xSemaphoreGive(_client_slot_mutex);
}

err_t AsyncServer::_accepted(AsyncClient *client) {
  if (_listen_connect_cb) {
    _listen_connect_cb(_connect_cb_arg, client);
  }
  return ERR_OK;
}

void AsyncServer::_handleDisconnect(AsyncClient *client) {
  if (client) {
    // ASYNC_TCP_CONSOLE("Delete Client %u", client);
    delete client;
  }
}

void AsyncServer::setNoDelay(bool nodelay) {
  _noDelay = nodelay;
}

bool AsyncServer::getNoDelay() const {
  return _noDelay;
}

uint8_t AsyncServer::status() const {
  if (!_pcb) {
    return 0;
  }
  return _pcb->state;
}
